{"name":"Sameer","headerTaglineOne":"Hey there","headerTaglineTwo":"My name is Sameer Agarwal","headerTaglineThree":"CS Student interested in programming and software development","headerTaglineFour":" based in Dallas, Texas.","showCursor":true,"showBlog":true,"darkMode":true,"showResume":true, "showContact":true,"projects":[{"id":"1","title":"PacMan on Street Maps","description":"Game Development","imageSrc":"https://community.wolfram.com//c/portal/getImageAttachment?filename=communityimage.png&userId=2963607","url":"https://community.wolfram.com/groups/-/m/t/2964621"}],"services":[{"id":"1","title":"Website Development","description":"I can create a Website for your company/organization fitting whichever criteria is required, using any framework. "},{"id":"23f19469-ef9d-4a87-99e6-94c84dd61758","title":"Computer Science Tutoring","description":"I can help you learn a new language and build a project with it"}],"aboutpara":"My name is Sameer Agarwal and I am a senior at the Texas Academy of Mathematics and Science in Denton, Texas. I am a full-time student taking courses at the University of North Texas. I'm interested in computer science and have been developing websites and other projects. I also am learning about Machine Learning, AI, and Applications. Some activities I do include FRC Robotics, Tutoring, and Computer Repair. In my free time, I read, play guitar, and enjoy time with friends. I hope this website shows you an insight into my journey with Computer Science so far. Thanks for reading!","resume":{"tagline":"👋  I'm a high school student who aspires to be a Software Engineer","description":"Experienced CIO with 3 years at Lightbulb Tutoring, trained and managed over 30 tutors. Proficient in C++, Python, and frameworks such as React and NextJs","experiences":[{"id":"1","dates":"8/2021 - Present","org":"FRC Robotics","position":"Programming Lead","bullets":["Participated in 3 different Robotics Competitions while in Robotics.","Won 3 team awards during participation in Robotics Competitions.","Learned how to use machinery and complete something with a team.","Learned Programming and designed a majority of the robot's code.","Led other programmers and taught them how to code. "]},{"id":"07a90288-a781-4636-bacd-ce456febf64b","dates":"2/2022 - Present","org":"Lightbulb Tutoring","position":"Director ","bullets":["I help to manage over 30 tutors.","I teach my own class of 2 students every week.","I coordinate with other departments to keep tutoring running smoothly.","I host workshops for tutors to improve their skills and also train new tutors"]},{"id":"d0404fe6-3779-4a64-aef6-ffbfb589225c","dates":"2/2024-Present","org":"Dermalyze","position":"Head Website Developer","bullets":["Developed a dynamic website for the Dermalyze company.","Learned and used React along with Next and Typescript to create the website.","Implemented an AI image classification model on the website.","Coded new features such as surveys and forms. "]}],"education":[{"id":"0","universityName":"Allen High School","universityDate":"2021-2023","universityPara":"Freshman and Sophomore","universityGPA":"3.84"},{"id":"1","universityName":"Texas Academy of Math and Science","universityDate":"2023-2025","universityPara":"Took classes at University of North Texas","universityGPA":"4.00"}],"languages":["Javascript","HTML5","CSS","Python","CPP","Wolfram Language"],"frameworks":["React","Typescript","NodeJs","NextJS","Vite"]}}